TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
/**
  ******************************************************************************
  * @file    serial_bus_spi_pal.c
  * @brief   Handling of the SPI bus for inter-MCU communication
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023-2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/

#include <cmsis_os2.h>

/* Platform definitions */
#include <stm32wlxx.h>

/* SPI protocol definitions */
#include "comm_def.h" /* Used only to keep SPI frame size consistent with the counterpart */

/* STM32 Utilities */
#include "sid_pal_log_like.h"
#include <sid_stm32_common_utils.h>

/* App-specific headers */
#include "main.h"
#include "serial_bus_spi_pal.h"

/* Private defines -----------------------------------------------------------*/

#define SPI_FRAME_DATA_SIZE                (STM32WLxx_RADIO_COMM_SPI_DATA_FRAME_SIZE)
static_assert((SPI_FRAME_DATA_SIZE) % sizeof(uint32_t) == 0u); /* SPI frame's data part shall be multiple of 4 to speed up memcpy */

#if (USE_SPI_CRC != 0U)
#  define SPI_FRAME_CRC_SIZE               (2u)
#else
#  define SPI_FRAME_CRC_SIZE               (0u)
#endif
#define SPI_FRAME_SIZE                     ((SPI_FRAME_DATA_SIZE) + (SPI_FRAME_CRC_SIZE))
#define SPI_RING_BUF_FRAMES                (24u)

#define NSS_DMA_INDEX_NSS_ACTIVATED        (0u)
#define NSS_DMA_INDEX_NSS_DEACTIVATED      (1u)

#define SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS (10u)
#define SPI_HAL_COMM_START_TIMEOUT_TICKS   (100u)
#define SPI_PERIPHERAL_RESET_DELAY_US      (10u)

#define SPI_RINGBUF_OVERRUN_DIAG_WATERMARK ((uint32_t)(0xDEADBEEFu))

#ifndef SIDEWALK_RADIO_SPI_INSTANCE_BASE
#  error "SIDEWALK_RADIO_SPI_INSTANCE_BASE is not defined. Please specify the SPI peripheral instance to use for inter-MCU communication in STM32WLxx Sidewalk Radio app"
#endif

/* Private macro -------------------------------------------------------------*/

#define SPI_RINGBUF_FRAME_PATTERN_SET(__start_addr__, __pattern__)  do\
                                                                    {\
                                                                        register uint32_t * write_ptr = (void *)((__start_addr__) + SPI_FRAME_DATA_SIZE);\
                                                                        do\
                                                                        {\
                                                                            write_ptr--;\
                                                                            *write_ptr = (__pattern__);\
                                                                        } while (write_ptr != (uint32_t *)(void *)(__start_addr__));\
                                                                    } while (0)
#define SPI_RINGBUF_ADVANCE_POSITION(__position_addr__, __advance_size__, __buf_start_addr__, __buf_end_addr__) \
                                                                    do\
                                                                    {\
                                                                        __position_addr__ = (__position_addr__) + (__advance_size__);\
                                                                        while (__position_addr__ >= (__buf_end_addr__))\
                                                                        {\
                                                                            (__position_addr__) = (__buf_start_addr__) + (__position_addr__ - (__buf_end_addr__));\
                                                                        }\
                                                                    } while (0)
#define SPI_RINGBUF_REWIND_POSITION(__position_addr__, __rewind_size__, __buf_start_addr__, __buf_end_addr__) \
                                                                    do\
                                                                    {\
                                                                        __position_addr__ = (__position_addr__) - (__rewind_size__);\
                                                                        while (__position_addr__ < (__buf_start_addr__))\
                                                                        {\
                                                                            (__position_addr__) = (__buf_end_addr__) - ((__buf_start_addr__) - __position_addr__);\
                                                                        }\
                                                                    } while (0)

#if (SERIAL_BUS_SPI_PAL_NSS_ACTIVATED_GPIO_PIN_STATE == GPIO_PIN_RESET)
#  define SIDEWALK_RADIO_SPI_NSS_ENABLE_TRIGGER()                   do\
                                                                    {\
                                                                        register const uint32_t mcu_rev = LL_DBGMCU_GetRevisionID();\
                                                                        if (mcu_rev > STM32WLxx_MCU_REV_Z)\
                                                                        {\
                                                                            /* Normally activate just rising edge detection */\
                                                                            SET_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                        else\
                                                                        {\
                                                                            /* Activate both edges as part of workaround for errata 2.2.1 */\
                                                                            SET_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                            SET_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                    } while (0)
#  define SIDEWALK_RADIO_SPI_NSS_DISABLE_TRIGGER()                  do\
                                                                    {\
                                                                        register const uint32_t mcu_rev = LL_DBGMCU_GetRevisionID();\
                                                                        if (mcu_rev > STM32WLxx_MCU_REV_Z)\
                                                                        {\
                                                                            /* Normally deactivate just rising edge detection */\
                                                                            CLEAR_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                        else\
                                                                        {\
                                                                            /* Deactivate both edges as part of workaround for errata 2.2.1 */\
                                                                            CLEAR_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                            CLEAR_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                        /* Clear IRQ flag */\
                                                                        __HAL_GPIO_EXTI_CLEAR_IT(SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                    } while (0)
#else
#  define SIDEWALK_RADIO_SPI_NSS_ENABLE_TRIGGER()                   do\
                                                                    {\
                                                                        register const uint32_t mcu_rev = LL_DBGMCU_GetRevisionID();\
                                                                        if (mcu_rev > STM32WLxx_MCU_REV_Z)\
                                                                        {\
                                                                            /* Normally activate just falling edge detection */\
                                                                            SET_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                        else\
                                                                        {\
                                                                            /* Activate both edges as part of workaround for errata 2.2.1 */\
                                                                            SET_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                            SET_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                    } while (0)
#  define SIDEWALK_RADIO_SPI_NSS_DISABLE_TRIGGER()                  do\
                                                                    {\
                                                                        register const uint32_t mcu_rev = LL_DBGMCU_GetRevisionID();\
                                                                        if (mcu_rev > STM32WLxx_MCU_REV_Z)\
                                                                        {\
                                                                            /* Normally deactivate just falling edge detection */\
                                                                            CLEAR_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                        else\
                                                                        {\
                                                                            /* Deactivate both edges as part of workaround for errata 2.2.1 */\
                                                                            CLEAR_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                            CLEAR_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                        }\
                                                                        /* Clear IRQ flag */\
                                                                        __HAL_GPIO_EXTI_CLEAR_IT(SIDEWALK_RADIO_SPI_NSS_Pin);\
                                                                    } while (0)
#endif

/* Private variables ---------------------------------------------------------*/

/* SPI DMA buffers. IMPORTANT: These buffers shall be aligned to 4 bytes boundary for better performance */
SID_STM32_ALIGN_4BYTES(static uint8_t rx_ringbuf[SPI_FRAME_SIZE      * SPI_RING_BUF_FRAMES]); /* Rx buffer needs space for data AND CRC since DMA will extract the CRC from the SPI Rx FIFO */
SID_STM32_ALIGN_4BYTES(static uint8_t tx_ringbuf[SPI_FRAME_DATA_SIZE * SPI_RING_BUF_FRAMES]); /* Tx buffer needs space for data only, CRC is added automatically by the SPI peripheral if requested */

/* SPI buffer pointers */
static volatile uint32_t tx_ringbuf_ingest_addr;
static volatile uint32_t rx_ringbuf_extract_addr;
static          uint32_t tx_ringbuf_end_addr; /* Pointer to the first byte AFTER the tx_ringbuf - used to speed up DMA Tx channel reloading */
static          uint32_t rx_ringbuf_end_addr; /* Pointer to the first byte AFTER the rx_ringbuf - used to speed up processing */

/* SPI NSS handling DMA buffers */
SID_STM32_ALIGN_4BYTES(static uint16_t nss_dma_spi_cr2_values[2]);
SID_STM32_ALIGN_4BYTES(static uint8_t  nss_dma_sck_gpio_moder[2]);
static uint32_t dma_dummy_tx_pending;

static serial_bus_spi_pal_rx_data_available_cb_t spi_rx_user_callback    = NULL;
static serial_bus_spi_pal_error_cb_t             spi_error_user_callback = NULL;

static uint32_t spi_pal_initialized = FALSE;

