TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
/* External variables --------------------------------------------------------*/

extern SPI_HandleTypeDef SIDEWALK_RADIO_SPI;
extern DMA_HandleTypeDef SIDEWALK_RADIO_SPI_DMA_TX;
extern DMA_HandleTypeDef SIDEWALK_RADIO_SPI_DMA_RX;
extern DMA_HandleTypeDef SIDEWALK_RADIO_SPI_DMA_NSS_DETECT;
extern DMA_HandleTypeDef SIDEWALK_RADIO_SPI_DMA_SCK_CTRL;

/* Private function prototypes -----------------------------------------------*/

static inline HAL_StatusTypeDef _hal_like_spi_hard_reset(void);
static inline void              _reset_xfer_control_dma_channel_states(void);
static inline HAL_StatusTypeDef _hal_like_spi_start_communication(const uint32_t timeout_ticks);
static inline HAL_StatusTypeDef _hal_like_spi_wait_fifo_state_until_timeout(const uint32_t fifo, const uint32_t state, const uint32_t timeout_ticks);
static inline HAL_StatusTypeDef _hal_like_spi_wait_flag_state_until_timeout(const uint32_t flag, const FlagStatus state, const uint32_t timeout_ticks);
static inline HAL_StatusTypeDef _hal_like_spi_end_txrx_transaction(void);
static        HAL_StatusTypeDef _hal_like_spi_abort(void);
static        HAL_StatusTypeDef _hal_like_spi_instance_init(void);
static inline HAL_StatusTypeDef _hal_like_spi_dma_channel_start(DMA_HandleTypeDef * const hdma, const uint32_t src_address, const uint32_t dst_address,
                                                                const uint32_t transactions_count);
static        void              _hal_like_spi_dma_transmit_cplt(DMA_HandleTypeDef * const hdma);
static        void              _hal_like_spi_dma_error_callback(DMA_HandleTypeDef * const hdma);
static        void              _hal_like_spi_error_callback(void);

/* Private function definitions ----------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline HAL_StatusTypeDef _hal_like_spi_hard_reset(void)
{
    HAL_StatusTypeDef err = HAL_OK;

    /* Completely de-initialize SPI and related DMA channels */
    (void)HAL_SPI_DeInit(&SIDEWALK_RADIO_SPI);

    /* Hard-reset the SPI peripheral */
    switch ((uint32_t)(void*)SIDEWALK_RADIO_SPI.Instance)
    {
#if defined (SPI1)
        case (uint32_t)SPI1:
            __HAL_RCC_SPI1_FORCE_RESET();
            sid_pal_delay_us(SPI_PERIPHERAL_RESET_DELAY_US);
             __HAL_RCC_SPI1_RELEASE_RESET();
            break;
#endif /* SPI1 */

#if defined (SPI2)
        case (uint32_t)SPI2:
            __HAL_RCC_SPI2_FORCE_RESET();
            sid_pal_delay_us(SPI_PERIPHERAL_RESET_DELAY_US);
            __HAL_RCC_SPI2_RELEASE_RESET();
            break;
#endif /* SPI1 */

        default:
            SID_PAL_LOG_ERROR("Cannot hard-reset SPI. Unknown SPI instance (base address 0x%x)", (uint32_t)(void*)SIDEWALK_RADIO_SPI.Instance);
            err = HAL_ERROR;
            break;
    }

    if (err != HAL_ERROR)
    {
        /* Re-initialize the SPI peripheral and related DMA channels */
        __HAL_SPI_RESET_HANDLE_STATE(&SIDEWALK_RADIO_SPI);
        err = HAL_SPI_Init(&SIDEWALK_RADIO_SPI);
    }

    /* Indicate SPI driver is not initialized from now on */
    spi_pal_initialized = FALSE;

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline void _reset_xfer_control_dma_channel_states(void)
{
    /* Store channel states */
    register const uint32_t dma_nss_detect_ccr_copy   = SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Instance->CCR;
    register const uint32_t dma_sck_ctrl_ccr_copy     = SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Instance->CCR;

    /* Disable channels before re-configuring */
    __HAL_DMA_DISABLE(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT);
    __HAL_DMA_DISABLE(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL);

    /* Restore the state of the SCK GPIO pin's MODER register and SPI's CR2 DMA requests config */
    const uint32_t sck_gpio_moder_offset              = SID_STM32_UTIL_POSITION_VAL(SIDEWALK_RADIO_SPI_SCK_Pin) * 2u; /* 2 bits per pin config in MODER register */
    SIDEWALK_RADIO_SPI_SCK_GPIO_Port->MODER          |= (MODE_ANALOG << sck_gpio_moder_offset);                       /* Set SCK to Hi-Z for now */
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN));

    /* Restore source address for the DMA channels */
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Instance->CMAR  = (uint32_t)&nss_dma_spi_cr2_values[NSS_DMA_INDEX_NSS_ACTIVATED];
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Instance->CNDTR = SID_STM32_UTIL_ARRAY_SIZE(nss_dma_spi_cr2_values);

    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Instance->CMAR    = (uint32_t)&nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_ACTIVATED];
    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Instance->CNDTR   = SID_STM32_UTIL_ARRAY_SIZE(nss_dma_sck_gpio_moder);

    /* Restore channel states - this will re-enable them if they were enabled on entry to this function */
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Instance->CCR   = dma_nss_detect_ccr_copy;
    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Instance->CCR     = dma_sck_ctrl_ccr_copy;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline HAL_StatusTypeDef _hal_like_spi_start_communication(const uint32_t timeout_ticks)
{
    register const uint32_t tick_start = HAL_GetTick();
    __COMPILER_BARRIER();

    HAL_StatusTypeDef err = HAL_ERROR;
    register uint32_t count = timeout_ticks * ((SystemCoreClock * 32U) >> 20U); /* Calculate timeout based on a software loop to avoid blocking issue if SysTick is disabled */

    /* Process locked */
    __HAL_LOCK(&SIDEWALK_RADIO_SPI);

    if (SIDEWALK_RADIO_SPI.State != HAL_SPI_STATE_READY)
    {
        err = HAL_BUSY;
        goto exit;
    }

    /* Ensure NSS is deselected before enabling the DMAMUX trigger */
    if (HAL_GPIO_ReadPin(SIDEWALK_RADIO_SPI_NSS_GPIO_Port, SIDEWALK_RADIO_SPI_NSS_Pin) == SERIAL_BUS_SPI_PAL_NSS_ACTIVATED_GPIO_PIN_STATE)
    {
        /* Wait for NSS to go high, otherwise NSS-controlled channel will not operate correctly */
        SID_PAL_LOG_WARNING("SPI NSS is activated before SPI is started. Waiting for NSS deactivation...");
        while (HAL_GPIO_ReadPin(SIDEWALK_RADIO_SPI_NSS_GPIO_Port, SIDEWALK_RADIO_SPI_NSS_Pin) == SERIAL_BUS_SPI_PAL_NSS_ACTIVATED_GPIO_PIN_STATE)
        {
            if (SID_STM32_UTIL_IS_IRQ_MODE() == FALSE)
            {
                /* We can use scheduler delays to allow other part of the firmware to do something useful while we are waiting */
                osDelay(1u);
            }
            else
            {
                /* We are in an IRQ context or the interrupts are disabled globally - scheduler delays are not possible */
                __NOP();
            }

            if (timeout_ticks != HAL_MAX_DELAY)
            {
                if (((HAL_GetTick() - tick_start) >= timeout_ticks) || (0u == count))
                {
                    SID_PAL_LOG_ERROR("SPI NSS is activated before SPI is started. Timeout on wait");
                    err = HAL_TIMEOUT;
                    goto exit;
                }

                /* Count iterations to protect from the SysTick being disabled or not incremented */
                if (count != 0u)
                {
                    count--;
                }
            }
        }
    }

