TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    /* Enable DMAMUX trigger that handles the NSS pin transitions */
    err = HAL_DMAEx_EnableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT);
    if (err != HAL_OK)
    {
        /* Update SPI error code */
        SID_PAL_LOG_ERROR("Failed to enable DMAMUX request for SPI DMA Request Control channel. HAL error 0x%x", (uint32_t)err);
        SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
        err = HAL_ERROR;
        goto exit;
    }

    /* Enable DMAMUX trigger that handles the NSS pin transitions */
    err = HAL_DMAEx_EnableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL);
    if (err != HAL_OK)
    {
        /* Update SPI error code */
        SID_PAL_LOG_ERROR("Failed to enable DMAMUX request for SPI SCK Pin Control channel. HAL error 0x%x", (uint32_t)err);
        SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
        err = HAL_ERROR;
        goto exit;
    }

    /* Enable SPI peripheral if all other parts were configured properly */
    __HAL_SPI_ENABLE(&SIDEWALK_RADIO_SPI);

    /* Check that NSS remains deactivated  */
    if (HAL_GPIO_ReadPin(SIDEWALK_RADIO_SPI_NSS_GPIO_Port, SIDEWALK_RADIO_SPI_NSS_Pin) == SERIAL_BUS_SPI_PAL_NSS_ACTIVATED_GPIO_PIN_STATE)
    {
        SID_PAL_LOG_ERROR("SPI NSS got activated while SPI is starting. SPI was not started to avoid undefined behavior");
        err = HAL_ERROR;
        goto exit;
    }

    /* Set HAL state indication */
    SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_BUSY_TX_RX;
    err = HAL_OK;

exit:
    if (err != HAL_OK)
    {
        /* Ensure DMAMUX generators remain disabled if something went wrong */
        (void)HAL_DMAEx_DisableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT);
        (void)HAL_DMAEx_DisableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL);

        /* Ensure control channels are in predefined state */
        _reset_xfer_control_dma_channel_states();
    }

    /* Process Unlocked */
    __HAL_UNLOCK(&SIDEWALK_RADIO_SPI);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline HAL_StatusTypeDef _hal_like_spi_wait_fifo_state_until_timeout(const uint32_t fifo, const uint32_t state, const uint32_t timeout_ticks)
{
    register const uint32_t tick_start = HAL_GetTick();
    __COMPILER_BARRIER();

    HAL_StatusTypeDef err = HAL_OK;
    volatile uint8_t * const ptmpreg8 = (volatile uint8_t *)&SIDEWALK_RADIO_SPI.Instance->DR;
    uint8_t  tmpreg8;
    register uint32_t count = timeout_ticks * ((SystemCoreClock * 35U) >> 20U); /* Calculate timeout based on a software loop to avoid blocking issue if SysTick is disabled */

    while ((SIDEWALK_RADIO_SPI.Instance->SR & fifo) != state)
    {
        /* If Rx FIFO shall be cleared... */
        if ((SPI_SR_FRLVL == fifo) && (SPI_FRLVL_EMPTY == state))
        {
            /* Flush Data Register by a blank read */
            tmpreg8 = *ptmpreg8;

            /* Avoid the compiler warning */
            UNUSED(tmpreg8);
        }

        if (timeout_ticks != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - tick_start) >= timeout_ticks) || (0u == count))
            {
                /* Disable the SPI and reset the CRC: the CRC value should be cleared
                 * on both master and slave sides in order to resynchronize the master
                 * and slave for their respective CRC calculation
                 */

                /* Disable TXE, RXNE and ERR interrupts for the interrupt process */
                __HAL_SPI_DISABLE_IT(&SIDEWALK_RADIO_SPI, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

                /* Disable SPI peripheral */
                __HAL_SPI_DISABLE(&SIDEWALK_RADIO_SPI);

                /* Reset CRC Calculation */
                if (SPI_CRCCALCULATION_ENABLE == SIDEWALK_RADIO_SPI.Init.CRCCalculation)
                {
                    SPI_RESET_CRC(&SIDEWALK_RADIO_SPI);
                }

                SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK(&SIDEWALK_RADIO_SPI);

                err = HAL_TIMEOUT;
                break;
            }

            /* Count iterations to protect from the SysTick being disabled or not incremented */
            if (count != 0u)
            {
                count--;
            }
        }
    }

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline HAL_StatusTypeDef _hal_like_spi_wait_flag_state_until_timeout(const uint32_t flag, const FlagStatus state, const uint32_t timeout_ticks)
{
    register const uint32_t tick_start = HAL_GetTick();
    __COMPILER_BARRIER();

    HAL_StatusTypeDef err = HAL_OK;
    register uint32_t count = timeout_ticks * ((SystemCoreClock * 32U) >> 20U); /* Calculate timeout based on a software loop to avoid blocking issue if SysTick is disabled */

    while ((__HAL_SPI_GET_FLAG(&SIDEWALK_RADIO_SPI, flag) ? SET : RESET) != state)
    {
        if (timeout_ticks != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - tick_start) >= timeout_ticks) || (0u == count))
            {
                /* Disable the SPI and reset the CRC: the CRC value should be cleared
                 * on both master and slave sides in order to resynchronize the master
                 * and slave for their respective CRC calculation
                 */

                /* Disable TXE, RXNE and ERR interrupts for the interrupt process */
                __HAL_SPI_DISABLE_IT(&SIDEWALK_RADIO_SPI, (SPI_IT_TXE | SPI_IT_RXNE | SPI_IT_ERR));

                /* Disable SPI peripheral */
                __HAL_SPI_DISABLE(&SIDEWALK_RADIO_SPI);

                /* Reset CRC Calculation */
                if (SPI_CRCCALCULATION_ENABLE == SIDEWALK_RADIO_SPI.Init.CRCCalculation)
                {
                    SPI_RESET_CRC(&SIDEWALK_RADIO_SPI);
                }

                SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;

                /* Process Unlocked */
                __HAL_UNLOCK(&SIDEWALK_RADIO_SPI);

                err = HAL_TIMEOUT;
                break;
            }

            /* Count iterations to protect from the SysTick being disabled or not incremented */
            if (count != 0u)
            {
                count--;
            }
        }
    }

