TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline HAL_StatusTypeDef _hal_like_spi_end_txrx_transaction(void)
{
    HAL_StatusTypeDef err = HAL_ERROR;

    do
    {
        /* Control if the TX fifo is empty */
        err = _hal_like_spi_wait_fifo_state_until_timeout(SPI_FLAG_FTLVL, SPI_FTLVL_EMPTY, SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS);
        if (err != HAL_OK)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_FLAG);
            break;
        }

        /* Control the BSY flag */
        err = _hal_like_spi_wait_flag_state_until_timeout(SPI_FLAG_BSY, RESET, SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS);
        if (err != HAL_OK)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_FLAG);
            break;
        }

        /* Control if the RX fifo is empty */
        err = _hal_like_spi_wait_fifo_state_until_timeout(SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS);
        if (err != HAL_OK)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_FLAG);
            break;
        }

        /* Everything is ok */
        err = HAL_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static HAL_StatusTypeDef _hal_like_spi_abort(void)
{
    HAL_StatusTypeDef err = HAL_ERROR;

    /* Disable DMAMUX generators - don't care about error codes here since any error means the respective generator is not functional anyway */
    (void)HAL_DMAEx_DisableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT);
    (void)HAL_DMAEx_DisableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL);

    /* Clear ERRIE interrupt to avoid error interrupts generation during Abort procedure */
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_ERRIE);

    /* Disable the SPI DMA Tx request if enabled */
    if (HAL_IS_BIT_SET(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_TXDMAEN))
    {
        /* Disable Tx DMA Request */
        CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, (SPI_CR2_TXDMAEN));

        /* Abort the SPI DMA Tx Stream/Channel : use blocking DMA Abort API (no callback) */
        SIDEWALK_RADIO_SPI.hdmatx->XferAbortCallback = NULL;

        /* Abort DMA Tx Handle linked to SPI Peripheral */
        err = HAL_DMA_Abort(SIDEWALK_RADIO_SPI.hdmatx);
        if (err != HAL_OK)
        {
            SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_ABORT;
        }

        err = _hal_like_spi_end_txrx_transaction();
        if (err != HAL_OK)
        {
            SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_ABORT;
        }

        /* Disable SPI Peripheral */
        __HAL_SPI_DISABLE(&SIDEWALK_RADIO_SPI);

        /* Ensure the Rx FIFO is empty after disabling the SPI */
        err = _hal_like_spi_wait_fifo_state_until_timeout(SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS);
        if (err != HAL_OK)
        {
            SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_ABORT;
        }
    }

    /* Disable the SPI DMA Rx request if enabled */
    if (HAL_IS_BIT_SET(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_RXDMAEN))
    {
        /* Disable Rx DMA Request */
        CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, (SPI_CR2_RXDMAEN));

        /* Abort the SPI DMA Rx Stream/Channel : use blocking DMA Abort API (no callback) */
        SIDEWALK_RADIO_SPI.hdmarx->XferAbortCallback = NULL;

        /* Abort DMA Rx Handle linked to SPI Peripheral */
        err = HAL_DMA_Abort(SIDEWALK_RADIO_SPI.hdmarx);
        if (err != HAL_OK)
        {
            SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_ABORT;
        }

        /* Disable peripheral */
        __HAL_SPI_DISABLE(&SIDEWALK_RADIO_SPI);

        /* Control the BSY flag */
        err = _hal_like_spi_wait_flag_state_until_timeout(SPI_FLAG_BSY, RESET, SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS);
        if (err != HAL_OK)
        {
            SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_ABORT;
        }

        /* Ensure the Rx FIFO is empty after disabling the SPI */
        err = _hal_like_spi_wait_fifo_state_until_timeout(SPI_FLAG_FRLVL, SPI_FRLVL_EMPTY, SPI_HAL_DEFAULT_WAIT_TIMEOUT_TICKS);
        if (err != HAL_OK)
        {
            SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_ABORT;
        }
    }

    /* Reset Tx and Rx transfer counters */
    SIDEWALK_RADIO_SPI.RxXferCount = 0U;
    SIDEWALK_RADIO_SPI.TxXferCount = 0U;

    /* Check error during Abort procedure */
    if (HAL_SPI_ERROR_ABORT == SIDEWALK_RADIO_SPI.ErrorCode)
    {
        /* return HAL_Error in case of error during Abort procedure */
        err = HAL_ERROR;
    }
    else
    {
        /* Reset errorCode */
        SIDEWALK_RADIO_SPI.ErrorCode = HAL_SPI_ERROR_NONE;
        err = HAL_OK;
    }

    /* Clear the Error flags in the SR register */
    __HAL_SPI_CLEAR_OVRFLAG(&SIDEWALK_RADIO_SPI);
    __HAL_SPI_CLEAR_FREFLAG(&SIDEWALK_RADIO_SPI);

    /* Indicate we are in error state and require re-initialization to resume operations */
    SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_ERROR;

    return err;
}

/*----------------------------------------------------------------------------*/

static HAL_StatusTypeDef _hal_like_spi_instance_init(void)
{
    HAL_StatusTypeDef err = HAL_ERROR;

    /*--------------------- EXTI Mode Configuration for NSS pin ------------*/
    /* Enable EXTI in SYSCFG */
    uint32_t position = SID_STM32_UTIL_POSITION_VAL(SIDEWALK_RADIO_SPI_NSS_Pin);
    uint32_t temp = SYSCFG->EXTICR[position >> 2u];
    temp &= ~(0x07uL << (4U * (position & 0x03U)));
    temp |= (GPIO_GET_INDEX(SIDEWALK_RADIO_SPI_NSS_GPIO_Port) << (4U * (position & 0x03U)));
    SYSCFG->EXTICR[position >> 2u] = temp;

    /* Clear any residual events */
    CLEAR_BIT(EXTI->RTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);
    CLEAR_BIT(EXTI->FTSR1, SIDEWALK_RADIO_SPI_NSS_Pin);
    __HAL_GPIO_EXTI_CLEAR_IT(SIDEWALK_RADIO_SPI_NSS_Pin);

    /* Enable NSS deactivation event for the pin. For Rev Z both activation and deactivation shall be enabled as part of workaround for errata 2.2.1 */
    SIDEWALK_RADIO_SPI_NSS_ENABLE_TRIGGER();

    /* Trigger EXTI interrupt, but don't generate event */
#ifdef CORE_CM0PLUS
    SET_BIT(EXTI->C2IMR1, SIDEWALK_RADIO_SPI_NSS_Pin);
    CLEAR_BIT(EXTI->C2EMR1, SIDEWALK_RADIO_SPI_NSS_Pin);
#else
    SET_BIT(EXTI->IMR1, SIDEWALK_RADIO_SPI_NSS_Pin);
    CLEAR_BIT(EXTI->EMR1, SIDEWALK_RADIO_SPI_NSS_Pin);
#endif /* CORE_CM0PLUS */

    /* Setup SPI buffer pointers */
    rx_ringbuf_extract_addr = (uint32_t)&rx_ringbuf[0];
    rx_ringbuf_end_addr     = (uint32_t)&rx_ringbuf[0] + sizeof(rx_ringbuf);
    tx_ringbuf_ingest_addr  = (uint32_t)&tx_ringbuf[0];
    tx_ringbuf_end_addr     = (uint32_t)&tx_ringbuf[0] + sizeof(tx_ringbuf);

    /* Configure Rx FIFO overrun diagnostic - since we know the first extract position we don't actually need to
     * prepopulate the entire Rx ring buffer with watermarks. It's enough to write down a single watermark to the
     * location that preceeds the extractions position.
     */
    uint32_t overrun_check_addr                     = rx_ringbuf_extract_addr;
    SPI_RINGBUF_REWIND_POSITION(overrun_check_addr, sizeof(SPI_RINGBUF_OVERRUN_DIAG_WATERMARK), (uint32_t)&rx_ringbuf[0], rx_ringbuf_end_addr);
    volatile uint32_t * const overrun_watermark_ptr = (volatile uint32_t *)(void *)overrun_check_addr;
    *overrun_watermark_ptr                          = SPI_RINGBUF_OVERRUN_DIAG_WATERMARK;

    /* Check rx & tx dma handles */
    assert_param(IS_SPI_DMA_HANDLE(SIDEWALK_RADIO_SPI.hdmarx));
    assert_param(IS_SPI_DMA_HANDLE(SIDEWALK_RADIO_SPI.hdmatx));

    /* Check Direction parameter */
    assert_param(IS_SPI_DIRECTION_2LINES(SIDEWALK_RADIO_SPI.Init.Direction));

