TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    /* Check SPI data frame settings */
    assert_param(SPI_DATASIZE_8BIT == SIDEWALK_RADIO_SPI.Init.DataSize); /* Only 8 bit data size is accepted, otherwise the bytes will be swapped due to Little Endian nature of the MCU */
    assert_param(SPI_POLARITY_LOW == SIDEWALK_RADIO_SPI.Init.CLKPolarity); /* Only low SCK polarity is supported due to hardware limitations of the implemented NSS control mechanism */

    /* NSS DMA channels params check */
    assert_param(sizeof(uint16_t)        == sizeof(nss_dma_spi_cr2_values[0]));
    assert_param(DMA_PDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Init.PeriphDataAlignment);
    assert_param(DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Init.MemDataAlignment);
    assert_param(DMA_CIRCULAR            == SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Init.Mode);

    assert_param(sizeof(uint8_t)         == sizeof(nss_dma_sck_gpio_moder[0]));
    assert_param(DMA_PDATAALIGN_BYTE     == SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Init.PeriphDataAlignment);
    assert_param(DMA_MDATAALIGN_BYTE     == SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Init.MemDataAlignment);
    assert_param(DMA_CIRCULAR            == SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Init.Mode);

    /* Check Tx DMA setting */
    assert_param((DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmatx->Init.MemDataAlignment) || (DMA_MDATAALIGN_BYTE == SIDEWALK_RADIO_SPI.hdmatx->Init.MemDataAlignment));
    if (DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmatx->Init.MemDataAlignment)
    {
        assert_param(DMA_PDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmatx->Init.PeriphDataAlignment);
    }
    else
    {
        assert_param(DMA_PDATAALIGN_BYTE == SIDEWALK_RADIO_SPI.hdmatx->Init.PeriphDataAlignment);
    }

    assert_param(DMA_NORMAL == SIDEWALK_RADIO_SPI.hdmatx->Init.Mode);

    /* Check Rx DMA setting */
    assert_param((DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmarx->Init.MemDataAlignment) || (DMA_MDATAALIGN_BYTE == SIDEWALK_RADIO_SPI.hdmarx->Init.MemDataAlignment));
    if (DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmarx->Init.MemDataAlignment)
    {
        assert_param(DMA_PDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmarx->Init.PeriphDataAlignment);
    }
    else
    {
        assert_param(DMA_PDATAALIGN_BYTE == SIDEWALK_RADIO_SPI.hdmarx->Init.PeriphDataAlignment);
    }
    assert_param(DMA_CIRCULAR == SIDEWALK_RADIO_SPI.hdmarx->Init.Mode);

    /* Process locked */
    __HAL_LOCK(&SIDEWALK_RADIO_SPI);

    if (SIDEWALK_RADIO_SPI.State != HAL_SPI_STATE_READY)
    {
        err = HAL_BUSY;
        goto exit;
    }

    /* Abort any ongoing transaction and bring the SPI peripheral to the Disabled state before any further configuration will take place */
    err = _hal_like_spi_abort();
    if (err != HAL_OK)
    {
        /* Failed to abort the SPI, try hard-reset instead */
        SID_PAL_LOG_WARNING("Failed to perform SPI abort. HAL error 0x%x. Will try hard reset instead", (uint32_t)err);

        err = _hal_like_spi_hard_reset();
        if (err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to perform SPI hard reset. HAL error 0x%x. Further initialization is not possible", (uint32_t)err);
            goto exit;
        }
    }
    else
    {
        /* Restore Ready state after successful abort */
        SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;
    }

    /* Set the transaction information */
    SIDEWALK_RADIO_SPI.ErrorCode   = HAL_SPI_ERROR_NONE;
    SIDEWALK_RADIO_SPI.pTxBuffPtr  = (uint8_t *)tx_ringbuf;
    SIDEWALK_RADIO_SPI.TxXferSize  = SPI_FRAME_DATA_SIZE;
    SIDEWALK_RADIO_SPI.TxXferCount = SIDEWALK_RADIO_SPI.TxXferSize; /* Initialize with bytes count, Tx channel always loops within one frame */
    SIDEWALK_RADIO_SPI.pRxBuffPtr  = (uint8_t *)rx_ringbuf;
    SIDEWALK_RADIO_SPI.RxXferSize  = sizeof(rx_ringbuf);
    SIDEWALK_RADIO_SPI.RxXferCount = SIDEWALK_RADIO_SPI.RxXferSize; /* Initialize with bytes count, actual xfer number will be adjusted later based on DMA transaction width */

    /* Init field not used in handle to zero */
    SIDEWALK_RADIO_SPI.RxISR       = NULL;
    SIDEWALK_RADIO_SPI.TxISR       = NULL;

    /* Reset CRC Calculation */
    if (SPI_CRCCALCULATION_ENABLE == SIDEWALK_RADIO_SPI.Init.CRCCalculation)
    {
        assert_param(USE_SPI_CRC != 0u); /* Ensure STM32_HAL is properly configured for SPI CRC usage */
        SPI_RESET_CRC(&SIDEWALK_RADIO_SPI);
    }

    /* Reset the threshold bit */
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_LDMATX | SPI_CR2_LDMARX);

    /* We are not going to use odd number of transfers anyway */
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_LDMATX);
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_LDMARX);

    /* The packing mode management is enabled by the DMA settings according the spi data size */
    if (DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmatx->Init.MemDataAlignment)
    {
        /* Ensure Rx & Tx buffers have the aligned size */
        assert_param(SID_STM32_UTIL_ARRAY_SIZE(rx_ringbuf) % sizeof(uint16_t) == 0u);
        assert_param(SID_STM32_UTIL_ARRAY_SIZE(tx_ringbuf) % sizeof(uint16_t) == 0u);

        /* Adjust the number of xfers for the DMA Rx channel */
        SIDEWALK_RADIO_SPI.TxXferCount = SIDEWALK_RADIO_SPI.TxXferCount >> 1; /* Each transaction will be 2 bytes, so we need twice less xfers */
    }

    if (DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmarx->Init.MemDataAlignment)
    {
        /* Set fiforxthreshold according the DMA transaction length: 16bit */
        CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_RXFIFO_THRESHOLD);

        /* Ensure Rx & Tx buffers have the aligned size */
        assert_param(SID_STM32_UTIL_ARRAY_SIZE(rx_ringbuf) % sizeof(uint16_t) == 0u);
        assert_param(SID_STM32_UTIL_ARRAY_SIZE(tx_ringbuf) % sizeof(uint16_t) == 0u);

        /* Adjust the number of xfers for the DMA Rx channel */
        SIDEWALK_RADIO_SPI.RxXferCount = SIDEWALK_RADIO_SPI.RxXferCount >> 1; /* Each transaction will be 2 bytes, so we need twice less xfers */
    }
    else
    {
        /* Set RX Fifo threshold according the DMA transaction length: 8bit */
        SET_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_RXFIFO_THRESHOLD);
    }

    /* Set the DMA error callback */
    SIDEWALK_RADIO_SPI.hdmarx->XferErrorCallback = _hal_like_spi_dma_error_callback;

    /* Clear the unsued DMA callbacks */
    SIDEWALK_RADIO_SPI.hdmarx->XferHalfCpltCallback = NULL;
    SIDEWALK_RADIO_SPI.hdmarx->XferCpltCallback     = NULL;
    SIDEWALK_RADIO_SPI.hdmarx->XferAbortCallback    = NULL;

    /* Enable the Rx DMA Stream/Channel */
    err = _hal_like_spi_dma_channel_start(SIDEWALK_RADIO_SPI.hdmarx, (uint32_t)&SIDEWALK_RADIO_SPI.Instance->DR,
                                          (uint32_t)SIDEWALK_RADIO_SPI.pRxBuffPtr, SIDEWALK_RADIO_SPI.RxXferCount);
    if (err != HAL_OK)
    {
        /* Update SPI error code */
        SID_PAL_LOG_ERROR("Failed to start SPI DMA Rx channel. HAL error 0x%x", (uint32_t)err);
        SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
        err = HAL_ERROR;

        SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;
        goto exit;
    }

    /* Set the DMA error callback */
    SIDEWALK_RADIO_SPI.hdmatx->XferErrorCallback    = _hal_like_spi_dma_error_callback;

    /* Set the SPI Tx/Rx DMA Half transfer complete callback */
    SIDEWALK_RADIO_SPI.hdmatx->XferCpltCallback     = _hal_like_spi_dma_transmit_cplt;

    /* Clear the unsued DMA callbacks */
    SIDEWALK_RADIO_SPI.hdmatx->XferHalfCpltCallback = NULL;
    SIDEWALK_RADIO_SPI.hdmatx->XferAbortCallback    = NULL;

    /* Prepare the first slot for a dummy Tx transaction */
    dma_dummy_tx_pending = TRUE;

    /* Enable the Tx DMA Stream/Channel */
    err = _hal_like_spi_dma_channel_start(SIDEWALK_RADIO_SPI.hdmatx, (uint32_t)SIDEWALK_RADIO_SPI.pTxBuffPtr, (uint32_t)&SIDEWALK_RADIO_SPI.Instance->DR,
                                          SIDEWALK_RADIO_SPI.TxXferCount);
    if (err != HAL_OK)
    {
        /* Update SPI error code */
        SID_PAL_LOG_ERROR("Failed to start SPI DMA Tx channel. HAL error 0x%x", (uint32_t)err);
        SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
        err = HAL_ERROR;

        SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;
        goto exit;
    }

    /* Configure SPI interrupts */
    __HAL_SPI_DISABLE_IT(&SIDEWALK_RADIO_SPI, (SPI_IT_TXE | SPI_IT_RXNE));
    __HAL_SPI_ENABLE_IT(&SIDEWALK_RADIO_SPI, SPI_IT_ERR);

