TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    /* Clear any residual interrupt flags */
    __HAL_SPI_CLEAR_FREFLAG(&SIDEWALK_RADIO_SPI);
    __HAL_SPI_CLEAR_MODFFLAG(&SIDEWALK_RADIO_SPI);
    __HAL_SPI_CLEAR_OVRFLAG(&SIDEWALK_RADIO_SPI);

    /* Use Software-controled NSS and set it to permanently selected state to allow automatic CRC counters reset at the end of the frame */
    SET_BIT(SIDEWALK_RADIO_SPI.Instance->CR1, SPI_CR1_SSM);
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR1, SPI_CR1_SSI);

    /* Configure DMA channel that controls SPI operation based on physical NSS pin transitions */
    nss_dma_spi_cr2_values[NSS_DMA_INDEX_NSS_ACTIVATED] = nss_dma_spi_cr2_values[NSS_DMA_INDEX_NSS_DEACTIVATED] = SIDEWALK_RADIO_SPI.Instance->CR2; /* Current state of SPI CR2 reg with SPI_CR2_TXDMAEN and SPI_CR2_RXDMAEN cleared - to be applied upon physical NSS goes high */
    nss_dma_spi_cr2_values[NSS_DMA_INDEX_NSS_ACTIVATED] = nss_dma_spi_cr2_values[NSS_DMA_INDEX_NSS_DEACTIVATED] | (SPI_CR2_RXDMAEN | SPI_CR2_TXDMAEN);  /* CR2 with SPI_CR2_RXDMAEN and SPI_CR2_TXDMAEN set - to be applied upon physical NSS goes low */

    /* Configure DMA writes to the SCK GPIO pin's MODER register to simulate SPI enabling/disabling by the NSS line. Use 8bit write operations
     * for MODER to reduce the amount of affected adjacent pins - only 4 pins instead of 16 on the same port will be affected because pin mode
     * configuration occupies two bits per pin.
     */
    const uint32_t sck_gpio_moder_position                 = SID_STM32_UTIL_POSITION_VAL(SIDEWALK_RADIO_SPI_SCK_Pin) * 2u; /* 2 bits per pin config in MODER register */
    const uint32_t sck_gpio_moder_byte_offset              = sck_gpio_moder_position    >> 3; /* byte addition to the MODER address since DMA will perform single byte writes */
    const uint32_t sck_gpio_moder_byte_shift               = sck_gpio_moder_byte_offset << 3; /* bit shift value to get the byte of interest from the MODER reg */
    nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_ACTIVATED]    = nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_DEACTIVATED] =  (uint8_t)(SIDEWALK_RADIO_SPI_SCK_GPIO_Port->MODER >> sck_gpio_moder_byte_shift);
    nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_ACTIVATED]    = nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_DEACTIVATED] &= (uint8_t)(~(GPIO_MODE << (sck_gpio_moder_position - sck_gpio_moder_byte_shift))); /* Clear MODE config */
    nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_ACTIVATED]   |= (uint8_t)(MODE_AF     << (sck_gpio_moder_position - sck_gpio_moder_byte_shift)); /* Configure for NSS select - Connect SCK to the SPI peripheral */
    nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_DEACTIVATED] |= (uint8_t)(MODE_ANALOG << (sck_gpio_moder_position - sck_gpio_moder_byte_shift)); /* Configure for NSS de-select - set SCK to Hi-Z - internal logic will be forced to zero */
    SIDEWALK_RADIO_SPI_SCK_GPIO_Port->MODER               |= (MODE_ANALOG << sck_gpio_moder_position); /* Set SCK to Hi-Z for now */

    /* Set the DMA error callbacks */
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.XferErrorCallback    = _hal_like_spi_dma_error_callback;
    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.XferErrorCallback      = _hal_like_spi_dma_error_callback;

    /* No other callbacks and DMA interrupts needed as this channel operates autonomously in circular mode */
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.XferHalfCpltCallback = NULL;
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.XferCpltCallback     = NULL;
    SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.XferAbortCallback    = NULL;

    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.XferHalfCpltCallback   = NULL;
    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.XferCpltCallback       = NULL;
    SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.XferAbortCallback      = NULL;

    /* Enable NSS-controled DMA channel */
    err = _hal_like_spi_dma_channel_start(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT,
                                          (uint32_t)&nss_dma_spi_cr2_values[NSS_DMA_INDEX_NSS_ACTIVATED],
                                          (uint32_t)&SIDEWALK_RADIO_SPI.Instance->CR2,
                                          SID_STM32_UTIL_ARRAY_SIZE(nss_dma_spi_cr2_values));
    if (err != HAL_OK)
    {
        /* Update SPI error code */
        SID_PAL_LOG_ERROR("Failed to start SPI DMA Requests Control DMA channel. HAL error 0x%x", (uint32_t)err);
        SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
        err = HAL_ERROR;

        SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;
        goto exit;
    }

    /* Enable NSS-controled DMA channel */
    err = _hal_like_spi_dma_channel_start(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL,
                                          (uint32_t)&nss_dma_sck_gpio_moder[NSS_DMA_INDEX_NSS_ACTIVATED],
                                          (uint32_t)&SIDEWALK_RADIO_SPI_SCK_GPIO_Port->MODER + sck_gpio_moder_byte_offset,
                                          SID_STM32_UTIL_ARRAY_SIZE(nss_dma_sck_gpio_moder));
    if (err != HAL_OK)
    {
        /* Update SPI error code */
        SID_PAL_LOG_ERROR("Failed to start SPI SCK Pin Control DMA channel. HAL error 0x%x", (uint32_t)err);
        SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
        err = HAL_ERROR;

        SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;
        goto exit;
    }

    /* If we got here everything is ok, indicate init is done */
    spi_pal_initialized = TRUE;

exit:
    if (err != HAL_OK)
    {
        /* Disable EXTI and DMA if configuration error happened */
        (void)HAL_DMAEx_DisableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT);
        (void)HAL_DMAEx_DisableMuxRequestGenerator(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL);
        CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN));

        (void)HAL_DMA_Abort(&SIDEWALK_RADIO_SPI_DMA_NSS_DETECT);
        (void)HAL_DMA_Abort(&SIDEWALK_RADIO_SPI_DMA_SCK_CTRL);
        (void)HAL_DMA_Abort(SIDEWALK_RADIO_SPI.hdmatx);
        (void)HAL_DMA_Abort(SIDEWALK_RADIO_SPI.hdmarx);
    }

    /* Process Unlocked */
    __HAL_UNLOCK(&SIDEWALK_RADIO_SPI);

