TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED static inline HAL_StatusTypeDef _hal_like_spi_dma_channel_start(DMA_HandleTypeDef * const hdma, const uint32_t src_address, const uint32_t dst_address,
                                                                                          const uint32_t transactions_count)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Check the parameters */
    assert_param(IS_DMA_BUFFER_SIZE(transactions_count));

    /* Process locked */
    __HAL_LOCK(hdma);

    if (hdma->State == HAL_DMA_STATE_READY)
    {
        /* Change DMA peripheral state */
        hdma->State = HAL_DMA_STATE_BUSY;
        hdma->ErrorCode = HAL_DMA_ERROR_NONE;

        /* Disable the peripheral */
        __HAL_DMA_DISABLE(hdma);

        /* Configure the source, destination address and the data length & clear flags*/
        /* Clear the DMAMUX synchro overrun flag */
        hdma->DMAmuxChannelStatus->CFR = hdma->DMAmuxChannelStatusMask;

        if (hdma->DMAmuxRequestGen != NULL)
        {
            /* Clear the DMAMUX request generator overrun flag */
            hdma->DMAmuxRequestGenStatus->RGCFR = hdma->DMAmuxRequestGenStatusMask;
        }

        /* Clear all flags */
        hdma->DmaBaseAddress->IFCR = (DMA_ISR_GIF1 << (hdma->ChannelIndex & 0x1CU));

        /* Configure DMA Channel data length */
        hdma->Instance->CNDTR = transactions_count;

        /* Memory to Peripheral */
        if ((hdma->Init.Direction) == DMA_MEMORY_TO_PERIPH)
        {
            /* Configure DMA Channel destination address */
            hdma->Instance->CPAR = dst_address;

            /* Configure DMA Channel source address */
            hdma->Instance->CMAR = src_address;
        }
        /* Peripheral to Memory */
        else
        {
            /* Configure DMA Channel source address */
            hdma->Instance->CPAR = src_address;

            /* Configure DMA Channel destination address */
            hdma->Instance->CMAR = dst_address;
        }

        /* Disable all interrupts */
        __HAL_DMA_DISABLE_IT(hdma, (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE));

        /* Enable the Transfer Complete interrupt if requested */
        if (NULL != hdma->XferCpltCallback)
        {
            __HAL_DMA_ENABLE_IT(hdma, DMA_IT_TC);
        }

        /* Enable the Half-Transfer Complete interrupt if requested */
        if (NULL != hdma->XferHalfCpltCallback)
        {
            __HAL_DMA_ENABLE_IT(hdma, DMA_IT_HT | DMA_IT_TE);
        }

        /* Enable the transfer Error interrupt if requested */
        if (NULL != hdma->XferHalfCpltCallback)
        {
            /* Enable the Half transfer complete interrupt as well */
            __HAL_DMA_ENABLE_IT(hdma, DMA_IT_TE);
        }

        /* Check if DMAMUX Synchronization is enabled*/
        if ((hdma->DMAmuxChannel->CCR & DMAMUX_CxCR_SE) != 0U)
        {
            /* Enable DMAMUX sync overrun IT*/
            hdma->DMAmuxChannel->CCR |= DMAMUX_CxCR_SOIE;
        }

        if (hdma->DMAmuxRequestGen != NULL)
        {
            /* if using DMAMUX request generator, enable the DMAMUX request generator overrun IT*/
            /* enable the request gen overrun IT*/
            hdma->DMAmuxRequestGen->RGCR |= DMAMUX_RGxCR_OIE;
        }

        /* Enable the Peripheral */
        __HAL_DMA_ENABLE(hdma);
    }
    else
    {
        /* Change the error code */
        hdma->ErrorCode = HAL_DMA_ERROR_BUSY;

        /* Process Unlocked */
        __HAL_UNLOCK(hdma);

        /* Return error status */
        status = HAL_ERROR;
    }

    return status;
}

/*----------------------------------------------------------------------------*/

/**
  * @brief  STM32 HAL style DMA TC event callback to handle SPI's end of transaction. This callback
  *         simulates circular mode for the DMA channel and supports the continuous SPI Tx/Rx operation.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains  the configuration information
  *              for the specified DMA module.
  * @retval None
 */
SID_STM32_SPEED_OPTIMIZED static void _hal_like_spi_dma_transmit_cplt(DMA_HandleTypeDef * const hdma)
{
    /* Disable all IRQs since it's essential to complete this callback ASAP and that tx_ringbuf_ingest_addr is not modified during the operation */
    UTILS_ENTER_CRITICAL_SECTION();

    /* Prevent any further DMA Tx requests */
    CLEAR_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_TXDMAEN);
    __HAL_DMA_DISABLE(hdma);
    __COMPILER_BARRIER(); /* Ensure DMA channels is disabled an DMA requests are stopped before any further actions */

    /* Move to the next frame placeholder in the ring buffer */
    const register uint32_t prev_dma_src_addr           = hdma->Instance->CMAR;
          register uint32_t next_dma_src_addr           = prev_dma_src_addr;
    const register uint32_t tx_ringbuf_ingest_addr_copy = tx_ringbuf_ingest_addr;

    /* Calculate the address of the next frame */
    next_dma_src_addr += SPI_FRAME_DATA_SIZE;
    if (next_dma_src_addr >= tx_ringbuf_end_addr)
    {
        /* Full circle done, rewind to the beginning */
        next_dma_src_addr = (uint32_t)&tx_ringbuf[0]; /* Don't use SIDEWALK_RADIO_SPI.pTxBuffPtr here since it will take more CPU instructions to load */
    }

    /* Act depending on the type of transaction that have just ended */
    if (FALSE == dma_dummy_tx_pending)
    {
        /* Handle the completion of a normal transaction */
        if (next_dma_src_addr == tx_ringbuf_ingest_addr_copy)
        {
            /* Currently there's no more data to transmit, enter the dummy transaction mode */
            dma_dummy_tx_pending = TRUE;

            /* Clear the slot that will be used for dummy Tx to avoid sending out duplicated responses
             *
             * IMPORTANT: not using memset() here to avoid branching instructions and maximize the processing speed.
             *            It is essential to ensure this handler completes ASAP
             */
            SPI_RINGBUF_FRAME_PATTERN_SET(next_dma_src_addr, 0x00000000u);
        }

        /* Update CMAR to point to the next transaction start address */
        hdma->Instance->CMAR = next_dma_src_addr;
    }
    else
    {
        /* Handle the completion of a dummy transaction */

        /* If tx_ringbuf_ingest_addr has moved it means we have new data to send out, dummy mode is not needed anymore */
        if (prev_dma_src_addr != tx_ringbuf_ingest_addr_copy)
        {
            dma_dummy_tx_pending = FALSE;
        }

        /* Don't touch CMAR reg as the payload transfer will commence from the same SPI frame slot as dummy transaction */
        /* hdma->Instance->CMAR = prev_dma_src_addr; - keep old address, don't actually uncomment this line to save some runtime. CMAR is already set to prev_dma_src_addr */
    }

    /* Restore transactions count register */
    hdma->Instance->CNDTR = SIDEWALK_RADIO_SPI.TxXferCount;

    /* Re-enable needed DMA interrupts since they are turned off by the generic HAL handler */
    __HAL_DMA_ENABLE_IT(hdma, DMA_IT_TE | DMA_IT_TC);
    __COMPILER_BARRIER(); /* Ensure all adjustments are applied before re-enablid the DMA channel */

    /* Re-enable DMA Tx channel after the configuration update */
    __HAL_DMA_ENABLE(hdma);
    /* Restore virtual state for compativbility with the HAL layer */
    hdma->State = HAL_DMA_STATE_BUSY;

