TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    UTILS_EXIT_CRITICAL_SECTION();
}

/*----------------------------------------------------------------------------*/

/**
  * @brief  STM32 HAL style DMA SPI communication error callback.
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains the configuration information for the specified DMA module.
  * @retval None
  */
SID_STM32_SPEED_OPTIMIZED static void _hal_like_spi_dma_error_callback(DMA_HandleTypeDef * const hdma)
{
    (void)hdma;

    /* Indicate DMA error */
    SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_DMA);
    SIDEWALK_RADIO_SPI.State = HAL_SPI_STATE_READY;

    /* Call the unified SPI/DMA error handler */
    _hal_like_spi_error_callback();
}

/*----------------------------------------------------------------------------*/

/**
  * @brief  STM32 HAL style SPI communication error callback.
  *         SPI handle is not required since it's guaranteed by the custom SPI IRQ handler implementation in this file
  *         that the only trigger source is SIDEWALK_RADIO_SPI
  * @retval None
  */
SID_STM32_SPEED_OPTIMIZED static void _hal_like_spi_error_callback(void)
{
    serial_bus_spi_pal_bus_error_details_t error_info;

    /* Collect SPI state info before processing the error */
    if (spi_error_user_callback != NULL)
    {
        error_info.error_code       = SIDEWALK_RADIO_SPI.ErrorCode;
        error_info.spi_sr           = SIDEWALK_RADIO_SPI.Instance->SR;
        error_info.dma_tx_ccr       = SIDEWALK_RADIO_SPI_DMA_TX.Instance->CCR;
        error_info.dma_rx_ccr       = SIDEWALK_RADIO_SPI_DMA_RX.Instance->CCR;
        error_info.dma_nss_dtct_ccr = SIDEWALK_RADIO_SPI_DMA_NSS_DETECT.Instance->CCR;
        error_info.dma_sck_ctrl_ccr = SIDEWALK_RADIO_SPI_DMA_SCK_CTRL.Instance->CCR;
    }
    __COMPILER_BARRIER();

    /* Stop any further SPI & DMA operations */
    (void)_hal_like_spi_abort();

    /* Invoke the user callback if it is defined */
    if (spi_error_user_callback != NULL)
    {
        /* Add any new errors that may have occured during SPI Abort */
        error_info.error_code |= SIDEWALK_RADIO_SPI.ErrorCode;
        spi_error_user_callback(&error_info);
    }
}

/* Global function definitions -----------------------------------------------*/

serial_bus_spi_pal_err_t sid_pal_serial_bus_spi_init(serial_bus_spi_pal_rx_data_available_cb_t rx_data_available_callback,
                                                     serial_bus_spi_pal_error_cb_t error_callback)
{
    serial_bus_spi_pal_err_t err = SERIAL_BUS_SPI_PAL_OK;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* Ensure SPI is not initialized already */
        if (spi_pal_initialized != FALSE)
        {
            err = SERIAL_BUS_SPI_PAL_ALREADY_INITIALIZED;
            break;
        }

        /* Set user callbacks */
        spi_rx_user_callback    = rx_data_available_callback;
        spi_error_user_callback = error_callback;

        /* Now init the hardware (SPI, DMA, GPIO) */
        hal_err = _hal_like_spi_instance_init();
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Host comm SPI initialization failed. HAL error 0x%x", (uint32_t)hal_err);
            err = SERIAL_BUS_SPI_PAL_HARDWARE_ERROR;
            break;
        }
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED serial_bus_spi_pal_err_t serial_bus_spi_xfer_start(void)
{
    serial_bus_spi_pal_err_t err = SERIAL_BUS_SPI_PAL_ERROR;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* Check that prior initializations were completed successfully */
        if (FALSE == spi_pal_initialized)
        {
            err = SERIAL_BUS_SPI_PAL_NOT_INITIALIZED;
            break;
        }

        /* Check that SPI is enabled */
        if (READ_BIT(SIDEWALK_RADIO_SPI.Instance->CR1, SPI_CR1_SPE) != 0u)
        {
            err = SERIAL_BUS_SPI_PAL_INVALID_STATE;
            break;
        }

        /* Enable SPI peripheral if all other parts were configured properly */
        hal_err = _hal_like_spi_start_communication(SPI_HAL_COMM_START_TIMEOUT_TICKS);
        if (hal_err != HAL_OK)
        {
            if (HAL_TIMEOUT == hal_err)
            {
                /* This is recoverable */
                err = SERIAL_BUS_SPI_PAL_TRY_LATER;
            }
            else
            {
                /* SPI and DMA state may be inconsistent, full-scale reset&restart is required */
                err = SERIAL_BUS_SPI_PAL_HARDWARE_ERROR;
            }
            break;
        }

        err = SERIAL_BUS_SPI_PAL_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED serial_bus_spi_pal_err_t serial_bus_spi_full_reinit(void)
{
    serial_bus_spi_pal_err_t err = SERIAL_BUS_SPI_PAL_ERROR;
    HAL_StatusTypeDef hal_err;

    do
    {
        /* Abort any ongoing SPI transactions */
        (void)_hal_like_spi_abort();

        /* Perform a hard reset of the SPI peripheral */
        hal_err = _hal_like_spi_hard_reset();
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Failed to perform SPI hard reset. HAL error 0x%x. Further initialization is not possible", (uint32_t)hal_err);
            err = SERIAL_BUS_SPI_PAL_HARDWARE_ERROR;
            break;
        }

        hal_err = _hal_like_spi_instance_init();
        if (hal_err != HAL_OK)
        {
            SID_PAL_LOG_ERROR("Host comm SPI reinitialization failed. HAL error 0x%x", (uint32_t)hal_err);
            err = SERIAL_BUS_SPI_PAL_HARDWARE_ERROR;
            break;
        }

        err =SERIAL_BUS_SPI_PAL_OK;
    } while (0);

    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED serial_bus_spi_pal_err_t serial_bus_spi_clear_fifos(const uint32_t timeout_ms)
{
    register const uint32_t tick_start = HAL_GetTick();
    __COMPILER_BARRIER();

    register const uint32_t timeout_ticks = timeout_ms != osWaitForever ? (timeout_ms / (uint32_t)HAL_GetTickFreq()) : HAL_MAX_DELAY;
    register uint32_t count = timeout_ticks * ((SystemCoreClock * 26U) >> 20U); /* Calculate timeout based on a software loop to avoid blocking issue if SysTick is disabled */

    /* Disable IRQ upon NSS deactivation to prevent software reaction on the frame that may be transmitted right now */
    SIDEWALK_RADIO_SPI_NSS_DISABLE_TRIGGER();

    /* Wait for any ongoing transactions to complete */
    while (READ_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, (SPI_CR2_TXDMAEN | SPI_CR2_RXDMAEN)) != 0u)
    {
        if (timeout_ticks != HAL_MAX_DELAY)
        {
            if (((HAL_GetTick() - tick_start) >= timeout_ticks) || (0u == count))
            {
                return SERIAL_BUS_SPI_PAL_TIMEOUT;
            }

            /* Count iterations to protect from the SysTick being disabled or not incremented */
            if (count != 0u)
            {
                count--;
            }
        }
    }

    /* Disable interrupts and place the data into the buffer */
    UTILS_ENTER_CRITICAL_SECTION();
    do
    {
        const register uint32_t current_tx_pos         = SIDEWALK_RADIO_SPI.hdmatx->Instance->CMAR;                                      /* Capture the start address of the current DMA Tx operation */
        const register uint32_t current_rx_cndtr_bytes = (DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmarx->Init.MemDataAlignment) ? /* Capture the CNDTR register of the DMA Rx operation. We cannot use CMAR register since it's not updated in circular mode */
                                                         (SIDEWALK_RADIO_SPI.hdmarx->Instance->CNDTR * 2u) :                             /* DMA runs in half-word mode, adjust CNDTR value to bytes equivalent */
                                                         SIDEWALK_RADIO_SPI.hdmarx->Instance->CNDTR;                                     /* DMA runs in byte-by-byte mode, no adjustments to the CNDTR value is needed */
              register uint32_t current_rx_ingest_addr;

        /* Ensure there's no systematic SW failure */
        assert_param((current_tx_pos >= (uint32_t)&tx_ringbuf[0]) && (current_tx_pos <= tx_ringbuf_end_addr));

        /* Calculate the nearest CNDTR for the fully completed SPI frames. Note: CNDTR is a decrementing counter that shows the number of remaining transactions */
        const register uint32_t frame_aligned_cndtr_bytes = ((current_rx_cndtr_bytes + (SPI_FRAME_SIZE - 1u)) / SPI_FRAME_SIZE) * SPI_FRAME_SIZE; /* Round up since CNDTR is a decrementing counter */

        /* Compute the ingest pointer */
        current_rx_ingest_addr = rx_ringbuf_end_addr - (sizeof(uint8_t) * frame_aligned_cndtr_bytes);

