TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
        /* Handle a corner case when CNDTR was captured during DMA channel reload (CNDTR == 0) */
        if (current_rx_ingest_addr >= rx_ringbuf_end_addr)
        {
            current_rx_ingest_addr = (uint32_t)&rx_ringbuf[0];
        }

        /* There's no active SPI transaction when this function is called, we can safely overwrite the extract and ingest pointers */
        rx_ringbuf_extract_addr = current_rx_ingest_addr;
        tx_ringbuf_ingest_addr  = current_tx_pos;

        /* Clear the slot that will be used for dummy Tx to avoid sending out duplicated responses
         *
         * IMPORTANT: not using memset() here to avoid branching instructions and maximize the processing speed.
         *            It is essential to ensure this handler completes ASAP
         */
        SPI_RINGBUF_FRAME_PATTERN_SET(current_tx_pos, 0x00000000u);
        dma_dummy_tx_pending = TRUE;

        /* Put the FIFO Override watermark */
        register uint32_t overrun_check_addr = current_rx_ingest_addr;
        SPI_RINGBUF_REWIND_POSITION(overrun_check_addr, sizeof(SPI_RINGBUF_OVERRUN_DIAG_WATERMARK), (uint32_t)&rx_ringbuf[0], rx_ringbuf_end_addr);
        uint32_t * overrun_watermark_ptr     = (uint32_t *)(void *)overrun_check_addr;
        *overrun_watermark_ptr               = SPI_RINGBUF_OVERRUN_DIAG_WATERMARK;
    } while (0);

    /* Re-enable NSS deactivation IRQ that notifies the app about freshly arrived data */
    SIDEWALK_RADIO_SPI_NSS_ENABLE_TRIGGER();

    UTILS_EXIT_CRITICAL_SECTION();

    return SERIAL_BUS_SPI_PAL_OK;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t serial_bus_spi_get_tx_fifo_free_level(void)
{
    register uint32_t fifo_free_space;

    /* Disable interrupts and place the data into the buffer */
    UTILS_ENTER_CRITICAL_SECTION();
    const register uint32_t current_tx_pos              = SIDEWALK_RADIO_SPI.hdmatx->Instance->CMAR; /* Capture the start address of the current DMA Tx operation */
    const register uint32_t spi_dma_tx_en               = READ_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_TXDMAEN); /* Capture if DMA Tx is currently scheduled */
    const register uint32_t tx_ringbuf_ingest_addr_copy = tx_ringbuf_ingest_addr;
    UTILS_EXIT_CRITICAL_SECTION();

    /* Ensure there's no systematic SW failure */
    assert_param((tx_ringbuf_ingest_addr_copy >= (uint32_t)&tx_ringbuf[0]) && (tx_ringbuf_ingest_addr_copy <= tx_ringbuf_end_addr));
    assert_param((current_tx_pos >= (uint32_t)&tx_ringbuf[0]) && (current_tx_pos <= tx_ringbuf_end_addr));

    if (current_tx_pos == tx_ringbuf_ingest_addr_copy)
    {
        if ((spi_dma_tx_en != 0u) && (FALSE == dma_dummy_tx_pending))
        {
            /* Special case: ingest pointer is equal to the write out pointer, but since DMA Tx is active the FIFO is actually full,
             * unless we are actually doing a dummy tx now - in such case the buffer is actually totally free and DMA is sending out
             * dummy data to keep the SPI peripheral's internal state machine rolling
             */
            fifo_free_space = 0u;
        }
        else
        {
            /* FIFO is absolutely free */
            fifo_free_space = sizeof(tx_ringbuf);
        }
    }
    else if (current_tx_pos < tx_ringbuf_ingest_addr_copy)
    {
        /* Ingest pointer is ahead of the write out pointer, it's easier and faster to calculate the occupied space first */
        const register uint32_t occupied_space = (tx_ringbuf_ingest_addr_copy - current_tx_pos);
        fifo_free_space = sizeof(tx_ringbuf) - occupied_space;
    }
    else
    {
        /* Ingest pointer is behind the write out pointer, it's easier and faster to calculate the free space directly */
        fifo_free_space = current_tx_pos - tx_ringbuf_ingest_addr_copy;
    }

    /* Calculate the amouint of free slots in Tx FIFO. Keep in mind CRC is calculated by the hardware during transmission and is not placed into the Tx buffer */
    const uint32_t fifo_free_level = (fifo_free_space / SPI_FRAME_DATA_SIZE);
    return fifo_free_level;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED uint32_t serial_bus_spi_get_rx_fifo_level(void)
{
    register uint32_t current_rx_ingest_addr;
    register uint32_t fifo_level;

    UTILS_ENTER_CRITICAL_SECTION();
    const register uint32_t current_rx_cndtr_bytes       = (DMA_MDATAALIGN_HALFWORD == SIDEWALK_RADIO_SPI.hdmarx->Init.MemDataAlignment) ? /* Capture the CNDTR register of the DMA Rx operation. We cannot use CMAR register since it's not updated in circular mode */
                                                           (SIDEWALK_RADIO_SPI.hdmarx->Instance->CNDTR * 2u) :                             /* DMA runs in half-word mode, adjust CNDTR value to bytes equivalent */
                                                           SIDEWALK_RADIO_SPI.hdmarx->Instance->CNDTR;                                     /* DMA runs in byte-by-byte mode, no adjustments to the CNDTR value is needed */
    const register uint32_t rx_ringbuf_extract_addr_copy = rx_ringbuf_extract_addr;
    UTILS_EXIT_CRITICAL_SECTION();
    __COMPILER_BARRIER();

    /* Perform FIFO overrun check */
    /* Compute the expected location of the FIFO overrun guard watermark */
    register uint32_t               overrun_check_addr    = rx_ringbuf_extract_addr_copy;
    SPI_RINGBUF_REWIND_POSITION(overrun_check_addr, sizeof(SPI_RINGBUF_OVERRUN_DIAG_WATERMARK), (uint32_t)&rx_ringbuf[0], rx_ringbuf_end_addr);
    /* Cast the address to the appropriate pointer type */
    const volatile uint32_t * const overrun_watermark_ptr = (volatile uint32_t *)(void *)overrun_check_addr;
    /* Check the presence of the watermark */
    if (*overrun_watermark_ptr != SPI_RINGBUF_OVERRUN_DIAG_WATERMARK)
    {
        return SERIAL_BUS_SPI_PAL_FIFO_LEVEL_OVERRUN;
    }

    /* Calculate the nearest CNDTR for the fully completed SPI frames. Note: CNDTR is a decrementing counter that shows the number of remaining transactions */
    const register uint32_t frame_aligned_cndtr_bytes = ((current_rx_cndtr_bytes + (SPI_FRAME_SIZE - 1u)) / SPI_FRAME_SIZE) * SPI_FRAME_SIZE; /* Round up since CNDTR is a decrementing counter */

    /* Compute the ingest pointer */
    current_rx_ingest_addr = rx_ringbuf_end_addr - (sizeof(uint8_t) * frame_aligned_cndtr_bytes);

