TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
    /* Handle a corner case when CNDTR was captured during DMA channel reload (CNDTR == 0) */
    if (current_rx_ingest_addr >= rx_ringbuf_end_addr)
    {
        current_rx_ingest_addr = (uint32_t)&rx_ringbuf[0];
    }

    /* Now we can calculate the occupied space */
    if (rx_ringbuf_extract_addr_copy == current_rx_ingest_addr)
    {
        /* FIFO is empty */
        fifo_level = 0u;
    }
    else if (rx_ringbuf_extract_addr_copy < current_rx_ingest_addr)
    {
        /* Ingest pointer is ahead of the read out pointer, it's easier and faster to calculate the occupied space directly */
        fifo_level = current_rx_ingest_addr - rx_ringbuf_extract_addr_copy;
    }
    else
    {
        /* Ingest pointer is behind the read out pointer, it's easier and faster to calculate the free space first */
        const register uint32_t free_space = (rx_ringbuf_extract_addr_copy - current_rx_ingest_addr);
        fifo_level = sizeof(rx_ringbuf) - free_space;
    }

    /* Finally convert raw size in bytes into FIFO frames count */
    fifo_level = fifo_level / SPI_FRAME_SIZE;

    return fifo_level;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED serial_bus_spi_pal_err_t serial_bus_spi_pop_from_rx_fifo(uint8_t * const buf, const uint32_t buf_size, uint32_t * const bytes_copied)
{
    serial_bus_spi_pal_err_t err = SERIAL_BUS_SPI_PAL_ERROR;

    /* Inputs check */
    if ((NULL == buf) || (NULL == bytes_copied) || (buf_size < SPI_FRAME_DATA_SIZE))
    {
        return SERIAL_BUS_SPI_PAL_INVALID_ARGS;
    }

    /* Calculate how much complete SPI frames can be fit into the supplied buffer */
    const register uint32_t max_fit_frames = buf_size / SPI_FRAME_DATA_SIZE;

    /* Initialize the output parameter */
    *bytes_copied = 0u;

    /* Disable interrupts while touching the buffer */
    UTILS_ENTER_CRITICAL_SECTION();

    /* Check how many frames we have and how many of them we can copy */
    const register uint32_t available_frames = serial_bus_spi_get_rx_fifo_level();
    if (SERIAL_BUS_SPI_PAL_FIFO_LEVEL_OVERRUN == available_frames)
    {
        /* Rx buffer overrun happened so we don't know how much data is valid in there - nothing can be copied */
        UTILS_EXIT_CRITICAL_SECTION();
        return SERIAL_BUS_SPI_PAL_FIFO_OVERRUN;
    }
    const register uint32_t frames_to_copy = max_fit_frames >= available_frames ? available_frames : max_fit_frames;

    /* Calculate the address of the FIFO Override watermark */
    register uint32_t overrun_check_addr = rx_ringbuf_extract_addr;
    SPI_RINGBUF_REWIND_POSITION(overrun_check_addr, sizeof(SPI_RINGBUF_OVERRUN_DIAG_WATERMARK), (uint32_t)&rx_ringbuf[0], rx_ringbuf_end_addr);

    /* Copy data - it's safe to do it outside of the critical section, the pointers are moved already, so nobody will be able to read them out in parallel */
    uint8_t * buf_write_ptr = buf;
    err = SERIAL_BUS_SPI_PAL_OK;
    for (uint32_t i = 0u; i < frames_to_copy; i++)
    {
        /* Copy the payload only, without CRC bytes */
        SID_STM32_UTIL_fast_memcpy(buf_write_ptr, (void *)rx_ringbuf_extract_addr, SPI_FRAME_DATA_SIZE);
        __COMPILER_BARRIER();

        /* FIFO override check shall take place here for each individual frame since if we are popping out multiple frames,
         * we actually don't care about an overwrite of the already-copied ones.
         *
         * Also, it's important to check for override AFTER the copying because DMA may overwrite the frame while we are copying
         */
        volatile uint32_t * overrun_watermark_ptr = (volatile uint32_t *)(void *)overrun_check_addr;
        if (*overrun_watermark_ptr != SPI_RINGBUF_OVERRUN_DIAG_WATERMARK)
        {
            err = SERIAL_BUS_SPI_PAL_FIFO_OVERRUN;
            break;
        }
        __COMPILER_BARRIER();

        /* Adjust pointers */
        buf_write_ptr += SPI_FRAME_DATA_SIZE;                                                                                 /* Advance the store pointer by the frame payload size (excluding CRC bytes) */
        SPI_RINGBUF_ADVANCE_POSITION(rx_ringbuf_extract_addr, SPI_FRAME_SIZE, (uint32_t)&rx_ringbuf[0], rx_ringbuf_end_addr); /* Advance the source pointer by full SPI frame size, including CRC bytes */
        SPI_RINGBUF_ADVANCE_POSITION(overrun_check_addr, SPI_FRAME_SIZE, (uint32_t)&rx_ringbuf[0], rx_ringbuf_end_addr);      /* Advance the overrun diag pointer by full SPI frame size, including CRC bytes */

        /* Note the amount of extracted data */
        *bytes_copied += SPI_FRAME_DATA_SIZE;

        /* Put FIFO overrun diagnostic watermark at the location of the just-extracted frame */
        overrun_watermark_ptr  = (volatile uint32_t *)(void *)overrun_check_addr;
        *overrun_watermark_ptr = SPI_RINGBUF_OVERRUN_DIAG_WATERMARK;
    }

    /* Re-enable the interrupts since we are done with the critical stuff */
    UTILS_EXIT_CRITICAL_SECTION();

    /* Everything is ok if we got here */
    return err;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED serial_bus_spi_pal_err_t serial_bus_spi_enqueue_tx(const uint8_t * const data, const uint32_t length)
{
    serial_bus_spi_pal_err_t ret = SERIAL_BUS_SPI_PAL_OK;
    const register uint32_t padding_length = (length % SPI_FRAME_DATA_SIZE) > 0u ? (SPI_FRAME_DATA_SIZE - (length % SPI_FRAME_DATA_SIZE)) : 0u;
    const register uint32_t aligned_length = length + padding_length;

    /* Validate inputs first */
    if ((NULL == data) || (0u == length) || (aligned_length > sizeof(tx_ringbuf)))
    {
        return SERIAL_BUS_SPI_PAL_INVALID_ARGS;
    }

    /* Disable interrupts and place the data into the buffer */
    UTILS_ENTER_CRITICAL_SECTION();

    /* Capture the tx_ringbuf_ingest_addr value on entry */
    register uint32_t tx_ringbuf_ingest_addr_copy = tx_ringbuf_ingest_addr;

    /* Ensure there's no systematic SW failure */
    assert_param((tx_ringbuf_ingest_addr_copy >= (uint32_t)&tx_ringbuf[0]) && (tx_ringbuf_ingest_addr_copy <= tx_ringbuf_end_addr));

    do
    {
        register uint32_t fifo_free_space;
        const register uint32_t current_tx_pos = SIDEWALK_RADIO_SPI.hdmatx->Instance->CMAR; /* Capture the start address of the current DMA Tx operation */
        const register uint32_t spi_dma_tx_en = READ_BIT(SIDEWALK_RADIO_SPI.Instance->CR2, SPI_CR2_TXDMAEN); /* Capture if DMA Tx is currently scheduled */

        /* Ensure there's no systematic SW failure */
        assert_param((current_tx_pos >= (uint32_t)&tx_ringbuf[0]) && (current_tx_pos <= tx_ringbuf_end_addr));

        if (current_tx_pos == tx_ringbuf_ingest_addr_copy)
        {
            if ((spi_dma_tx_en != 0u) && (FALSE == dma_dummy_tx_pending))
            {
                /* Special case: ingest pointer is equal to the write out pointer, but since DMA Tx is active the FIFO is actually full,
                 * unless we are actually doing a dummy tx now - in such case the buffer is actually totally free and DMA is sending out
                 * dummy data to keep the SPI peripheral's internal state machine rolling
                 */
                fifo_free_space = 0u;
            }
            else
            {
                /* FIFO is absolutely free */
                fifo_free_space = sizeof(tx_ringbuf);
            }
        }
        else if (current_tx_pos < tx_ringbuf_ingest_addr_copy)
        {
            /* Ingest pointer is ahead of the write out pointer, it's easier and faster to calculate the occupied space first */
            const register uint32_t occupied_space = (tx_ringbuf_ingest_addr_copy - current_tx_pos);
            fifo_free_space = sizeof(tx_ringbuf) - occupied_space;
        }
        else
        {
            /* Ingest pointer is behind the write out pointer, it's easier and faster to calculate the free space directly */
            fifo_free_space = current_tx_pos - tx_ringbuf_ingest_addr_copy;
        }

        /* Now check if we have enough space in Tx FIFO */
        if (aligned_length > fifo_free_space)
        {
            ret = SERIAL_BUS_SPI_PAL_NO_FREE_SPACE;
            break;
        }

