TrangLu1999/STM32-Sidewalk-SDK-main/apps/st/common/stm32wl55x_radio/Sidewalk/serial_bus_spi_pal.c
        register uint32_t direct_copy_length;
        register uint32_t wrapped_copy_length;
        if ((tx_ringbuf_ingest_addr_copy + length) <= tx_ringbuf_end_addr)
        {
            /* All the pending data fits linearly into the reminder of the Tx ring buffer */
            direct_copy_length  = length;
            wrapped_copy_length = 0u;
        }
        else
        {
            direct_copy_length  = tx_ringbuf_end_addr - tx_ringbuf_ingest_addr_copy;
            wrapped_copy_length = length - direct_copy_length;
        }

        if (direct_copy_length > 0u)
        {
            /* Fill up the space till the end of the buffer region in RAM */
            SID_STM32_UTIL_fast_memcpy((void *)tx_ringbuf_ingest_addr_copy, data, direct_copy_length);

            /* Advance the ingestion pointer and wrap it if necessary */
            tx_ringbuf_ingest_addr_copy += direct_copy_length;
            if (tx_ringbuf_ingest_addr_copy == tx_ringbuf_end_addr)
            {
                tx_ringbuf_ingest_addr_copy = (uint32_t)&tx_ringbuf[0];
            }
            else if (tx_ringbuf_ingest_addr_copy > tx_ringbuf_end_addr)
            {
                /* This should never happen unless there's a systematic failure in the code above */
                ret = SERIAL_BUS_SPI_PAL_ALIGNMENT_ERROR;
                break;
            }
            else
            {
                /* No need to do anything */
            }
        }

        /* Copy the wrapped part (if any) to the start of the buffer */
        if (wrapped_copy_length > 0u)
        {
            SID_STM32_UTIL_fast_memcpy((void *)tx_ringbuf_ingest_addr_copy, (void *)((uint32_t)&data[0] + direct_copy_length), wrapped_copy_length);
            tx_ringbuf_ingest_addr_copy += wrapped_copy_length;
        }

        /* Add padding to complete the frame */
        register uint32_t direct_padding_length;
        register uint32_t wrapped_padding_length;
        if ((tx_ringbuf_ingest_addr_copy + padding_length) <= tx_ringbuf_end_addr)
        {
            /* All the pending data fits linearly into the reminder of the Tx ring buffer */
            direct_padding_length  = padding_length;
            wrapped_padding_length = 0u;
        }
        else
        {
            direct_padding_length  = tx_ringbuf_end_addr - tx_ringbuf_ingest_addr_copy;
            wrapped_padding_length = padding_length - direct_padding_length;
        }

        /* Fill up the space till the end of the buffer region in RAM */
        if (direct_padding_length > 0u)
        {
            SID_STM32_UTIL_fast_memset((void *)tx_ringbuf_ingest_addr_copy, 0x00u, direct_padding_length);

            /* Advance the ingestion pointer and wrap it if necessary */
            tx_ringbuf_ingest_addr_copy += direct_padding_length;
            if (tx_ringbuf_ingest_addr_copy == tx_ringbuf_end_addr)
            {
                tx_ringbuf_ingest_addr_copy = (uint32_t)&tx_ringbuf[0];
            }
            else if (tx_ringbuf_ingest_addr_copy > tx_ringbuf_end_addr)
            {
                /* This should never happen unless there's a systematic failure in the code above */
                ret = SERIAL_BUS_SPI_PAL_ALIGNMENT_ERROR;
                break;
            }
            else
            {
                /* No need to do anything */
            }
        }

        /* Fill the wrapped part (if any) */
        if (wrapped_padding_length > 0u)
        {
            SID_STM32_UTIL_fast_memset((void *)tx_ringbuf_ingest_addr_copy, 0x00u, wrapped_padding_length);
            tx_ringbuf_ingest_addr_copy += wrapped_padding_length;
        }

        /* Ensure there's no systematic SW failure */
        assert_param((tx_ringbuf_ingest_addr_copy >= (uint32_t)&tx_ringbuf[0]) && (tx_ringbuf_ingest_addr_copy <= tx_ringbuf_end_addr));
        assert_param(((tx_ringbuf_ingest_addr_copy - (uint32_t)&tx_ringbuf[0]) % SPI_FRAME_DATA_SIZE) == 0u);

        /* Store back the modified tx_ringbuf_ingest_addr */
        tx_ringbuf_ingest_addr = tx_ringbuf_ingest_addr_copy;

        /* Ensure all the stuff is done before we proceed with arming the DMA */
        __COMPILER_BARRIER();

        /* If no active SPI communication was running on entry we should cancel dma_dummy_tx_pending flag, otherwise keep it as is,
         * and DMA Tx Completed interrupt will take care of it
         */
        if (spi_dma_tx_en == 0u)
        {
            dma_dummy_tx_pending = FALSE;
        }
    } while (0);

    /* Re-enable interrupts */
    UTILS_EXIT_CRITICAL_SECTION();

    return ret;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void * serial_bus_spi_get_current_enqueue_ptr(void)
{
    void * ptr;

    UTILS_ENTER_CRITICAL_SECTION();
    ptr = (void *)tx_ringbuf_ingest_addr;
    UTILS_EXIT_CRITICAL_SECTION();

    return ptr;
}

/*----------------------------------------------------------------------------*/

SID_STM32_SPEED_OPTIMIZED void serial_bus_spi_on_frame_received(void)
{
    if (spi_rx_user_callback != NULL)
    {
        spi_rx_user_callback();
    }
}

/*----------------------------------------------------------------------------*/

/**
 * @brief Customized SPI IRQ callback to speed up SPI IRQ processing
 *        Since this module uses DMA for SPI xfers only the error IRQs are generated
 */
#if   (defined (SPI1)) && ((SPI1_BASE) == (SIDEWALK_RADIO_SPI_INSTANCE_BASE))
SID_STM32_SPEED_OPTIMIZED void SPI1_IRQHandler(void)
#elif (defined (SPI2)) && ((SPI2_BASE) == (SIDEWALK_RADIO_SPI_INSTANCE_BASE))
SID_STM32_SPEED_OPTIMIZED void SPI2_IRQHandler(void)
#else
#  error "Unknown SPI instance specified in SIDEWALK_RADIO_SPI_INSTANCE"
#endif
{
    register const uint32_t spi_cr2_copy = SIDEWALK_RADIO_SPI.Instance->CR2;
    register const uint32_t spi_sr_copy  = SIDEWALK_RADIO_SPI.Instance->SR;

    /* SPI in Error Treatment --------------------------------------------------*/
    if ((spi_cr2_copy & SPI_IT_ERR) != 0u)
    {
        /* SPI Overrun error interrupt occurred ----------------------------------*/
        if ((spi_sr_copy & SPI_FLAG_OVR) != 0u)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_OVR);
            __HAL_SPI_CLEAR_OVRFLAG(&SIDEWALK_RADIO_SPI);
        }

        /* SPI Mode Fault error interrupt occurred -------------------------------*/
        if ((spi_sr_copy & SPI_FLAG_MODF) != 0u)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_MODF);
            __HAL_SPI_CLEAR_MODFFLAG(&SIDEWALK_RADIO_SPI);
        }

        /* SPI Frame error interrupt occurred ------------------------------------*/
        if ((spi_sr_copy & SPI_FLAG_FRE) != 0u)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_FRE);
            __HAL_SPI_CLEAR_FREFLAG(&SIDEWALK_RADIO_SPI);
        }

#if (USE_SPI_CRC != 0U)
        /* SPI CRC error interrupt occurred --------------------------------------*/
        if ((spi_sr_copy & SPI_FLAG_CRCERR) != 0u)
        {
            SET_BIT(SIDEWALK_RADIO_SPI.ErrorCode, HAL_SPI_ERROR_CRC);
            __HAL_SPI_CLEAR_CRCERRFLAG(&SIDEWALK_RADIO_SPI);
        }
#endif /* USE_SPI_CRC */

        /* Trigger SPI Abort if any critical error was detected */
        if (SIDEWALK_RADIO_SPI.ErrorCode != HAL_SPI_ERROR_NONE)
        {
            _hal_like_spi_error_callback();
        }
    }
}
